{
  "backend/main.mo": "Main Motoko actor defining Character and Battle types with stats, domain expansions, and elemental resistances; includes 25 hardcoded characters (Tyson, Peter, Dustin, Corey, etc.) and battle management with Map storage and comparison functions for sorting by energy/attack/defense.",
  "backend/migration.mo": "Migration module defining OldActor and NewActor types with identical Character and Battle structures; currently implements a no-op migration that returns the old state unchanged.",
  "feature_evidence.json": "Feature evidence report documenting three implemented features: character selection screen with Streets of Tyson roster, Q-key login with Internet Identity, and JJK Arena branding updates across UI components.",
  "frontend-file-summaries.txt": "Comprehensive summaries of all frontend TypeScript/React files including routing, authentication, character selection, battle arena, combat mechanics, keyboard controls, health/energy meters, and styling configurations.",
  "frontend/index.css": "Tailwind CSS base layer defining CSS custom properties for light and dark themes using OKLCH color system with variables for background, foreground, card, primary, secondary, muted, accent, destructive, border, and sidebar colors.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, 'JJK Arena' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with protected routes (character selection, arena) and public login route; wraps app with ThemeProvider, InternetIdentityProvider, GameHeader, footer with caffeine.ai attribution, and Toaster for notifications.",
  "frontend/src/components/AbilityButton.tsx": "Reusable card component displaying ability name, description, energy cost with icon, damage value, and use button with disabled state handling.",
  "frontend/src/components/ActionPanel.tsx": "Combat action panel rendering six ability buttons (Punch, Defend, Cursed Technique, Special Move, Domain Expansion, Black Flash) with keyboard shortcuts, damage calculations based on character stats, and action processing with toast notifications.",
  "frontend/src/components/BattleArena.tsx": "Main battle arena component that orchestrates the combat UI, managing health/energy states, keyboard controls, character movement, and special effects (domain expansion, black flash). Handles turn-based gameplay and renders all battle sub-components.",
  "frontend/src/components/BlackFlashEffect.tsx": "Visual effect component for Black Flash attacks, displaying an animated impact with spinning energy, particle bursts, screen flash, and text indicator that auto-completes after 1.5 seconds.",
  "frontend/src/components/CharacterCard.tsx": "Displays a character selection card with portrait image, name, and stats (attack, defense, cursed energy). Shows selected/disabled states with visual feedback.",
  "frontend/src/components/CharacterSprite.tsx": "Renders an animated character sprite on the battlefield with position transforms for jumping, crouching, and horizontal movement, including visual effects like shadows.",
  "frontend/src/components/CursedEnergyMeter.tsx": "Displays a purple gradient progress bar showing current vs maximum cursed energy with an icon and numeric values.",
  "frontend/src/components/DomainExpansionEffect.tsx": "Full-screen cinematic effect for domain expansion attacks, showing the domain name, character, effect description, and stat boosts with animated background overlay and particles.",
  "frontend/src/components/GameHeader.tsx": "Top navigation header displaying the JJK Arena logo and logout button for authenticated users using Internet Identity.",
  "frontend/src/components/HealthBar.tsx": "Red gradient progress bar component displaying current and maximum health values with a heart icon.",
  "frontend/src/components/KeyboardControlsIndicator.tsx": "Grid display of keyboard controls (WASD, G, N, H, K) showing available actions with visual indicators for enabled/disabled states based on turn and energy.",
  "frontend/src/components/MovesetPanel.tsx": "Modal overlay displaying a character's complete moveset including basic stats, basic moves (punch), abilities, and special techniques with damage/energy costs.",
  "frontend/src/components/TurnIndicator.tsx": "Displays the current turn number (Player 1 or 2) and battle score in badge components at the top of the arena.",
  "frontend/src/hooks/useActor.ts": "Manages the backend actor instance using React Query, creating authenticated or anonymous actors based on Internet Identity state and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCharacterMovement.ts": "Provides character movement logic with position tracking (x-axis), stance management (standing/jumping/crouching), and animated state transitions with timeouts.",
  "frontend/src/hooks/useCharacters.ts": "Simple wrapper hook that re-exports the useGetCharacters query hook for fetching character data.",
  "frontend/src/hooks/useCombat.ts": "Provides combat-related queries and mutations including fetching battle state, creating battles, and executing domain expansions with automatic query invalidation.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication with React context, managing login/logout flow, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useKeyboardControls.ts": "Tracks keyboard input state for keys w/a/s/d/g/n/h/k with 300ms cooldown per key and optional enable/disable control.",
  "frontend/src/hooks/useQueries.ts": "Defines a React Query hook to fetch characters sorted by energy from the backend actor when authenticated.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom dark theme color variables, typography styles, and keyframe animations for combat effects (domain pulse, float, black flash, jump, crouch).",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/pages/Arena.tsx": "Battle arena page that creates a battle from URL search params (p1, p2 character indices), displays loading state, and renders the BattleArena component with navigation controls.",
  "frontend/src/pages/CharacterSelection.tsx": "Character selection page that displays a grid of available characters, allows selecting two fighters, maps character names to image assets, and navigates to the arena with selected indices.",
  "frontend/src/pages/Login.tsx": "Login page component that authenticates users via Internet Identity, redirects authenticated users to home, and supports Q key shortcut for login with a styled card UI featuring JJK Arena branding.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color scheme using OKLCH color space, custom animations (accordion, pulse-glow), glow shadows, and extended theme utilities for the JJK Arena UI.",
  "project_state.json": "Project state tracking document for JJK Arena 2D fighting game, listing architectural notes, existing features (character selection, login, branding), pending feature requests (roster, customization, combat controls), and required image assets."
}