{
  "backend/main.mo": "Motoko actor defining Character type with stats (health, attack, defense, cursedEnergy), comparison functions for sorting, and match management with createMatch, getMatch, and character query functions sorted by energy/attack/defense.",
  "feature_evidence.json": "Feature evidence report mapping five implemented features (game arena, combat system, character selection, battle UI, dark fantasy theme) to their corresponding frontend files and test IDs with high confidence ratings.",
  "frontend-file-summaries.txt": "JSON object containing one-sentence summaries of all frontend TypeScript/TSX files describing their component responsibilities and functionality.",
  "frontend/index.css": "Tailwind CSS base styles defining CSS custom properties for light and dark themes using OKLCH color space with Jujutsu Kaisen-inspired dark fantasy color palette.",
  "frontend/index.html": "HTML entry point with UTF-8 charset, viewport meta tag, 'Jujutsu Kaisen Arena' title, root div, and module script loading main.tsx.",
  "frontend/src/App.tsx": "Root application component configuring TanStack Router with character selection and arena routes, ThemeProvider wrapper, GameHeader, footer with caffeine.ai attribution, and Toaster for notifications.",
  "frontend/src/components/AbilityButton.tsx": "Card-based ability button component displaying ability name, description, energy cost, damage stats, and a use button with disabled state handling.",
  "frontend/src/components/ActionPanel.tsx": "Combat action panel managing turn-based actions (attack, defend, cursed technique, special move) with damage calculation, energy costs, and toast notifications for action results.",
  "frontend/src/components/BattleArena.tsx": "Main battle arena component with background image, displaying both fighters with portraits, health/energy bars, turn indicator, and action panel while managing local health and energy state.",
  "frontend/src/components/CharacterCard.tsx": "Displays a character card with image, name, and stats (attack, defense, cursed energy) with selection, disabled, and hover states.",
  "frontend/src/components/CursedEnergyMeter.tsx": "Renders a purple gradient progress bar showing current/max cursed energy with an icon.",
  "frontend/src/components/GameHeader.tsx": "Displays a sticky header with the game logo centered at the top of the page.",
  "frontend/src/components/HealthBar.tsx": "Renders a red gradient progress bar showing current/max health with a heart icon.",
  "frontend/src/components/TurnIndicator.tsx": "Displays badges showing the current player turn (1 or 2) and the current score with a trophy icon.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor based on Internet Identity, invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useCharacters.ts": "Simple wrapper hook that calls useGetCharacters to fetch character data.",
  "frontend/src/hooks/useCombat.ts": "Manages combat match state with queries for fetching match data and mutations for creating new matches.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context with login/logout functionality and identity state management using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines a query hook to fetch characters sorted by energy from the backend actor.",
  "frontend/src/index.css": "Defines Tailwind CSS configuration with custom CSS variables for dark theme colors, typography, and utility classes for glowing effects.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the App component.",
  "frontend/src/pages/Arena.tsx": "Arena page that creates a match from URL parameters (p1, p2) and displays the BattleArena component with loading and error states.",
  "frontend/src/pages/CharacterSelection.tsx": "Character selection page where users pick two different characters (Player 1 and Player 2) to start a battle, displaying character cards in a grid layout.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with custom color scheme using OKLCH color space, extended animations (accordion, pulse-glow), custom shadows (glow effects), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state file for a Jujutsu Kaisen turn-based combat game set in the Culling Games, tracking 5 implemented features (arena, combat system, character selection, battle UI, visual theme) and 3 pending feature requests (character roster, points system)."
}