{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace JJK characters with Streets of Tyson roster and add login screen",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Update character selection screen to display the new Streets of Tyson character roster with their themed portraits and stats",
      "acceptanceCriteria": [
        "Character selection screen fetches and displays Streets of Tyson characters",
        "Character cards show appropriate Streets of Tyson themed information",
        "Both players can select from the full roster"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/CharacterSelection.tsx",
          "operation": "modify",
          "description": "Update the character selection page to display Streets of Tyson characters. The page already fetches characters from the backend via useGetCharacters hook. Update UI text and labels to reflect Streets of Tyson theme while maintaining the existing character card display structure with stats (attack, defense, cursed energy). Ensure both player selection panels work with the new roster."
        },
        {
          "path": "frontend/src/components/CharacterCard.tsx",
          "operation": "modify",
          "description": "Update the character card component to reference the newly generated Streets of Tyson character portrait images from frontend/public/assets/generated/streets-tyson-char1.dim_400x400.png through streets-tyson-char8.dim_400x400.png. Map character names to their corresponding portrait images. Maintain the existing card layout showing character name and stats."
        },
        {
          "path": "frontend/public/assets/generated/streets-tyson-char1.dim_400x400.png",
          "operation": "create",
          "description": "Wire the generated Streets of Tyson character portrait for book 1 character into the assets directory. This image will be referenced by CharacterCard component when displaying the character roster."
        },
        {
          "path": "frontend/public/assets/generated/streets-tyson-char2.dim_400x400.png",
          "operation": "create",
          "description": "Wire the generated Streets of Tyson character portrait for book 2 character into the assets directory. This image will be referenced by CharacterCard component when displaying the character roster."
        },
        {
          "path": "frontend/public/assets/generated/streets-tyson-char3.dim_400x400.png",
          "operation": "create",
          "description": "Wire the generated Streets of Tyson character portrait for book 3 character into the assets directory. This image will be referenced by CharacterCard component when displaying the character roster."
        },
        {
          "path": "frontend/public/assets/generated/streets-tyson-char4.dim_400x400.png",
          "operation": "create",
          "description": "Wire the generated Streets of Tyson character portrait for book 4 character into the assets directory. This image will be referenced by CharacterCard component when displaying the character roster."
        },
        {
          "path": "frontend/public/assets/generated/streets-tyson-char5.dim_400x400.png",
          "operation": "create",
          "description": "Wire the generated Streets of Tyson character portrait for book 5 character into the assets directory. This image will be referenced by CharacterCard component when displaying the character roster."
        },
        {
          "path": "frontend/public/assets/generated/streets-tyson-char6.dim_400x400.png",
          "operation": "create",
          "description": "Wire the generated Streets of Tyson character portrait for book 6 character into the assets directory. This image will be referenced by CharacterCard component when displaying the character roster."
        },
        {
          "path": "frontend/public/assets/generated/streets-tyson-char7.dim_400x400.png",
          "operation": "create",
          "description": "Wire the generated Streets of Tyson character portrait for book 7 character into the assets directory. This image will be referenced by CharacterCard component when displaying the character roster."
        },
        {
          "path": "frontend/public/assets/generated/streets-tyson-char8.dim_400x400.png",
          "operation": "create",
          "description": "Wire the generated Streets of Tyson character portrait for book 8 character into the assets directory. This image will be referenced by CharacterCard component when displaying the character roster."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Create a login screen accessible by pressing the Q key that serves as the entry point to the game, using the existing Internet Identity authentication system",
      "acceptanceCriteria": [
        "Q key triggers display of login screen",
        "Login screen integrates with existing Internet Identity authentication",
        "After successful login, user proceeds to character selection",
        "Login screen displays 'JJK Arena' as the game title"
      ],
      "file_operations": [
        {
          "path": "frontend/src/pages/Login.tsx",
          "operation": "create",
          "description": "Create a new login screen component that displays the JJK Arena branding using the generated logo from frontend/public/assets/generated/jjk-arena-logo.dim_800x200.png and background image from frontend/public/assets/generated/login-bg.dim_1920x1080.png. Integrate with the existing useInternetIdentity hook for authentication. Show a login button that triggers Internet Identity authentication. After successful login, programmatically navigate to the character selection page. Include a keyboard listener for the Q key to trigger the login modal or action when not yet authenticated."
        },
        {
          "path": "frontend/public/assets/generated/jjk-arena-logo.dim_800x200.png",
          "operation": "create",
          "description": "Wire the generated JJK Arena logo image into the assets directory. This logo will be displayed on the login screen and potentially in the game header."
        },
        {
          "path": "frontend/public/assets/generated/login-bg.dim_1920x1080.png",
          "operation": "create",
          "description": "Wire the generated login background image into the assets directory. This background will be used on the login screen to set the visual atmosphere."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the router configuration to add a new login route at path '/login' that renders the Login component. Make this the default route or add logic to redirect unauthenticated users to /login before they can access character selection. Wire the Q key listener at the app level to show the login screen when Q is pressed and the user is not authenticated. Import and register the new Login page component."
        },
        {
          "path": "frontend/src/pages/CharacterSelection.tsx",
          "operation": "modify",
          "description": "Add authentication guard logic at the top of the CharacterSelection component. Use the useInternetIdentity hook to check if the user is authenticated. If not authenticated, redirect to the login page. This ensures users must log in before accessing character selection."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Update all UI text, branding, and references to reflect 'JJK Arena' as the official game name while keeping the Streets of Tyson character theme",
      "acceptanceCriteria": [
        "Page title displays 'JJK Arena'",
        "Header and branding elements show 'JJK Arena'",
        "Game maintains Streets of Tyson character roster while using JJK Arena branding"
      ],
      "file_operations": [
        {
          "path": "frontend/index.html",
          "operation": "modify",
          "description": "Update the page title from 'Jujutsu Kaisen Arena' to 'JJK Arena' in the HTML head section."
        },
        {
          "path": "frontend/src/components/GameHeader.tsx",
          "operation": "modify",
          "description": "Update the header component to display 'JJK Arena' branding. Replace or supplement the existing logo with the generated JJK Arena logo from frontend/public/assets/generated/jjk-arena-logo.dim_800x200.png. Maintain the existing purple glow effect and backdrop blur styling."
        },
        {
          "path": "frontend/src/pages/CharacterSelection.tsx",
          "operation": "modify",
          "description": "Update any page-level headings or titles to reference 'JJK Arena' instead of 'Jujutsu Kaisen Arena'. Ensure the page describes the game as JJK Arena while displaying the Streets of Tyson character roster."
        }
      ]
    }
  ]
}